tap "candid82/brew"
tap "catppuccin/tap"
tap "felixkratz/formulae"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "osx-cross/arm"
tap "purduesigbots/pros"
tap "yqrashawn/goku"
brew "openssl@3"
brew "pcre2"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.12"
brew "glib"
brew "libxcb"
brew "fribidi"
brew "zstd"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "giflib"
brew "highway"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "bat"
brew "btop"
brew "c-ares"
brew "chezmoi"
brew "cmatrix"
brew "node"
brew "corepack"
brew "dav1d"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "fd"
brew "frei0r"
brew "leptonica"
brew "libarchive"
brew "opus"
brew "libsodium"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "mesa"
brew "freeglut"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnu-tar"
brew "libgpg-error"
brew "libksba"
brew "gtk+3"
brew "helix"
brew "hwloc"
brew "jq"
brew "lc0"
brew "lsd"
brew "luajit"
brew "magic-wormhole"
brew "msgpack"
brew "ncurses"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nss"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "pyinstaller"
brew "python@3.11"
brew "tcl-tk"
brew "python-tk@3.11"
brew "python@3.10"
brew "qt"
brew "qt@5"
brew "ripgrep"
brew "switchaudio-osx"
brew "tbb"
brew "thefuck"
brew "tldr"
brew "watchexec"
brew "yazi"
brew "you-get"
brew "yt-dlp", link: false
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "catppuccin/tap/catwalk"
brew "felixkratz/formulae/sketchybar"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "yqrashawn/goku/goku"
cask "betterdisplay"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "git-credential-manager"
cask "jordanbaird-ice"
cask "keycastr"
cask "mitmproxy"
cask "sf-symbols"
cask "wineskin"
