tap "candid82/brew"
tap "catppuccin/tap"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "purduesigbots/pros"
tap "railwaycat/emacsmacport"
tap "yqrashawn/goku"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "libunistring"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "jpeg-turbo"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "giflib"
brew "highway"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "ca-certificates"
brew "openssl@3"
brew "libssh2"
brew "readline"
brew "aria2"
brew "at-spi2-core"
brew "m4"
brew "autoconf"
brew "automake"
brew "awk"
brew "bash"
brew "libgit2"
brew "bat"
brew "bison"
brew "btop"
brew "c-ares"
brew "certifi"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "gmp"
brew "coreutils"
brew "croc"
brew "dav1d"
brew "mpdecimal"
brew "python@3.13"
brew "docutils"
brew "dust"
brew "fd"
brew "frei0r"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "icu4c@76"
brew "python-packaging"
brew "libass"
brew "mbedtls"
brew "mpg123"
brew "opus"
brew "libsodium"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "mesa"
brew "freeglut"
brew "libtool"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "libgpg-error"
brew "libksba"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "gtk+3"
brew "helix"
brew "hugo"
brew "hwloc"
brew "icu4c@75"
brew "jansson"
brew "jpeg"
brew "jq"
brew "lc0"
brew "libgit2@1.8"
brew "libpcap"
brew "libzip"
brew "llvm"
brew "lsd"
brew "luajit"
brew "lzip"
brew "make"
brew "node"
brew "markdownlint-cli"
brew "meson"
brew "mpv"
brew "msgpack"
brew "ncurses"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nss"
brew "ocrmypdf"
brew "pgloader"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyinstaller"
brew "pytest"
brew "python-setuptools"
brew "python@3.11"
brew "python@3.12"
brew "qt"
brew "qt@5"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "scipy"
brew "shellcheck"
brew "starship"
brew "swig"
brew "switchaudio-osx"
brew "tbb"
brew "tcl-tk"
brew "television"
brew "texinfo"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "util-macros"
brew "watchexec"
brew "wget"
brew "xcb-proto"
brew "xh"
brew "xtrans"
brew "yazi"
brew "you-get"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "candid82/brew/joker"
brew "joker"
brew "catppuccin/tap/catwalk"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-c9rgreen-sonoma-icon", "with-ctags", "with-dbus", "with-debug", "with-imagemagick", "with-mailutils", "with-xwidgets"]
brew "felixkratz/formulae/sketchybar"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "yqrashawn/goku/goku"
cask "betterdisplay"
cask "font-monaspace"
cask "git-credential-manager"
cask "mitmproxy"
cask "sf-symbols"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gregorbiswanger.json2ts"
vscode "hollowtree.vue-snippets"
vscode "ivhernandez.vscode-plist"
vscode "loiane.ts-extension-pack"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pmneo.tsimporter"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "stringham.move-ts"
vscode "tauri-apps.tauri-vscode"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vue.volar"
